# # 비지도 학습
# Unsupervised Learning
# 
# target값 (y, 레이블) 없는 머신러닝 알고리즘

"""
과인사진 들을 종류별로 모을수 있을까?

사진에 대한 정답 (타겟, 레이블) 을 알지 못하는데?
"""
None

# # 군집 알고리즘

# # 데이터 준비

# 과일 사진 데이터 준비

# 사과, 바나나, 파인애플 을 담고 있는 grayscale 이미지
# 넘파이 저장포맷 npy 형태

# 사과, 바나나, 파인애플 이 각각 100개씩 들어있다
#   처음 100개는 사과, 그 다름 100개는 파인애플, 마지막 100개는 바나나

# 데이터 출처
#    https://www.kaggle.com/datasets/moltean/fruits

import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import os

base_path = r'/content/drive/MyDrive/KoreaIT (코리아it)/250107 💚자연어처리/[AI자연어]/dataset(AI2501)'

file_path = os.path.join(base_path, 'fruits_300.npy')
fruits = np.load(file_path)
fruits.shape
# >>> 출력:
# (300, 100, 100)

# (샘플개수, height, width)
# (300, 100, 100)

# 첫번째 이미지
fruits[0]
# >>> 출력:
# array([[1, 1, 1, ..., 1, 1, 1],
#        [1, 1, 1, ..., 1, 1, 1],
#        [1, 1, 1, ..., 1, 1, 1],
#        ...,
#        [1, 1, 1, ..., 1, 1, 1],
#        [1, 1, 1, ..., 1, 1, 1],
#        [1, 1, 1, ..., 1, 1, 1]], dtype=uint8)

fruits[0, 0, :]
# >>> 출력:
# array([  1,   1,   1,   1,   1,   1,   1,   1,   1,   1,   1,   1,   1,
#          1,   1,   1,   2,   1,   2,   2,   2,   2,   2,   2,   1,   1,
#          1,   1,   1,   1,   1,   1,   2,   3,   2,   1,   2,   1,   1,
#          1,   1,   2,   1,   3,   2,   1,   3,   1,   4,   1,   2,   5,
#          5,   5,  19, 148, 192, 117,  28,   1,   1,   2,   1,   4,   1,
#          1,   3,   1,   1,   1,   1,   1,   2,   2,   1,   1,   1,   1,
#          1,   1,   1,   1,   1,   1,   1,   1,   1,   1,   1,   1,   1,
#          1,   1,   1,   1,   1,   1,   1,   1,   1], dtype=uint8)

# grayscale 이미지는 0 ~ 255 까지의 정숫값 가짐.

# 이미지 시각화
plt.imshow(fruits[0], cmap='gray')
plt.show()

# ![](https://image-res.xtool.com/resource/xtool/community/attachment/xtool-community/d52628b5-822d-472f-8f43-11c38312ff13/invert.png?x-oss-process=image/resize,m_fill,w_800,h_600,limit_0/interlace,1/format,webp)

# 이미지의 주 관심대상은 '바탕' 아니라 '사과'다
# 만약에 바탕이 흰색이면, 각종 연산에서 255에 가까운 바탕에 집중하게 될것이다.
# 그래서 바탕을 검게!,  사과를 밝게!  반정(invert) 하여 다룬다.

plt.imshow(fruits[0], cmap='gray_r')  # 우리 눈에 보기 좋게 gray_r 로 반전 출력
plt.show()

# ↓ 밝은 부분이 0 에 가깝고, 짙은 부분이 255 에 가까운 거다!

fig, axs = plt.subplots(1, 2)
axs[0].imshow(fruits[100], cmap='gray_r')
axs[1].imshow(fruits[200], cmap='gray_r')
plt.show()

# 어떻게 분류할수 있을까?
# 도전 아이디어! -> 사진의 픽셀값을 모두 '평균' 내면 비슷한 과일끼리 모을수 있을까?

# # 픽셀값 분석하기

"""
step 1. 사용하기 쉽게 fruits 데이터를 사과, 파인애플, 바나나로 각각 나누어 봅시다.
step 2. (100, 100) -> (10000, ) 으로 1차원 배열로 만들기. => 배열계산에 편리해진다.
step 3. 픽셀의 평균값 계산하기
"""
None

# step1
apple = fruits[0:100].reshape(-1, 100 * 100)
pineapple = fruits[100:200].reshape(-1, 100 * 100)
banana = fruits[200:300].reshape(-1, 100 * 100)

apple.shape, pineapple.shape, banana.shape
# >>> 출력:
# ((100, 10000), (100, 10000), (100, 10000))

apple.mean(axis=1)  # 100개의 사과 이미지의 픽셀 평균값들
# >>> 출력:
# array([ 88.3346,  97.9249,  87.3709,  98.3703,  92.8705,  82.6439,
#         94.4244,  95.5999,  90.681 ,  81.6226,  87.0578,  95.0745,
#         93.8416,  87.017 ,  97.5078,  87.2019,  88.9827, 100.9158,
#         92.7823, 100.9184, 104.9854,  88.674 ,  99.5643,  97.2495,
#         94.1179,  92.1935,  95.1671,  93.3322, 102.8967,  94.6695,
#         90.5285,  89.0744,  97.7641,  97.2938, 100.7564,  90.5236,
#        100.2542,  85.8452,  96.4615,  97.1492,  90.711 , 102.3193,
#         87.1629,  89.8751,  86.7327,  86.3991,  95.2865,  89.1709,
#         96.8163,  91.6604,  96.1065,  99.6829,  94.9718,  87.4812,
#         89.2596,  89.5268,  93.799 ,  97.3983,  87.151 ,  97.825 ,
#        103.22  ,  94.4239,  83.6657,  83.5159, 102.8453,  87.0379,
#         91.2742, 100.4848,  93.8388,  90.8568,  97.4616,  97.5022,
#         82.446 ,  87.1789,  96.9206,  90.3135,  90.565 ,  97.6538,
#         98.0919,  93.6252,  87.3867,  84.7073,  89.1135,  86.7646,
#         88.7301,  86.643 ,  96.7323,  97.2604,  81.9424,  87.1687,

# 히스토그램을 통해 3개 과일의 픽셀 평균값이 어떻게 분포되었는지 확인

plt.hist(np.mean(apple, axis=1), alpha=0.8)
plt.hist(np.mean(pineapple, axis=1), alpha=0.8)
plt.hist(np.mean(banana, axis=1), alpha=0.8)
plt.legend(['apple', 'pineapple', 'banana'])
plt.show()

# 바나나는  사과,파인애플과는 확실히 구분되나
# 사과 와 파인애플은 펵셀평균값으로는 구분하기 쉽지 않겠다.

# 아이디어2)
#  샘플의 평균값이 아니라, 픽셀별 평균값을 비교해보면 어떨까? <= 세 과일의 '모양' 이 다르니 픽셀값이 높은 위치도 다르지 않을까?

np.mean(apple, axis=0)  # 이미지 한장당 100 x 100 = 10000 픽셀 , 각 픽셀별 평균.
# >>> 출력:
# array([1.01, 1.01, 1.01, ..., 1.  , 1.  , 1.  ])

np.mean(apple, axis=0).shape
# >>> 출력:
# (10000,)

fig, axs = plt.subplots(1, 3, figsize=(20, 5))
axs[0].bar(range(10000), np.mean(apple, axis=0))
axs[1].bar(range(10000), np.mean(pineapple, axis=0))
axs[2].bar(range(10000), np.mean(banana, axis=0))
plt.show()

apple_mean = np.mean(apple, axis=0).reshape(100, 100)
pineapple_mean = np.mean(pineapple, axis=0).reshape(100, 100)
banana_mean = np.mean(banana, axis=0).reshape(100, 100)

fig, axs = plt.subplots(1, 3, figsize=(20, 5))
axs[0].imshow(apple_mean, cmap='gray_r')
axs[1].imshow(pineapple_mean, cmap='gray_r')
axs[2].imshow(banana_mean, cmap='gray_r')
plt.show()

# 위 대표이미지(?)와 가까운 사진을 골라낸다면 사과 / 파인애플 / 바나나를 구분할수 있을까?

# # 평균값과 가까운 이미지 고르기

# 사과 사진의 평균값인 apple_mean 과 가장 가까운 사진을 골라봅니다.
# 이때 '절대값 오차' 를 사용해보자.
# fruits 배열에 있는 모든 샘플에서 apple_mean 을 뺀 절대값의 평균을 계산하면 된다.

abs_diff = np.abs(fruits - apple_mean)

abs_diff.shape
# >>> 출력:
# (300, 100, 100)

# 각 샘플에 대한 오차 평균을 구하기 위해 axis 에 두번째 세번째 차원을 모두 지정.
abs_mean = np.mean(abs_diff, axis=(1, 2))
abs_mean.shape  # (300,)   각 샘플의 오차 평균.
# >>> 출력:
# (300,)

abs_mean
# >>> 출력:
# array([17.37576 , 13.508874, 17.183394, 15.68311 , 17.983306, 20.565392,
#        16.795812, 16.144276, 19.611994, 21.32059 , 16.454222, 16.590134,
#        13.37039 , 17.23263 , 15.92806 , 15.496638, 18.582212, 16.48196 ,
#        27.651556, 19.7871  , 20.826912, 16.417934, 17.059946, 15.904296,
#        15.086176, 19.371364, 24.076362, 14.777732, 19.20517 , 20.805182,
#        14.797906, 18.658418, 15.973216, 13.04259 , 18.381052, 16.59904 ,
#        16.288504, 18.960586, 13.88574 , 16.497594, 18.40376 , 19.174642,
#        29.096702, 18.40849 , 28.223962, 21.42994 , 19.740466, 15.590532,
#        13.082678, 18.765996, 14.391198, 21.464746, 26.261028, 15.887148,
#        18.568706, 16.410426, 17.108034, 13.178824, 18.199846, 13.503056,
#        20.845032, 16.898184, 22.81774 , 18.99896 , 19.102706, 16.636216,
#        14.845644, 19.357872, 14.778086, 14.468082, 13.085526, 15.946606,
#        20.42774 , 16.241996, 13.720382, 18.416166, 15.229106, 16.411342,
#        13.47148 , 20.050622, 17.296816, 21.071312, 18.451708, 19.645494,
#        15.585712, 20.582004, 13.850318, 13.269222, 21.875262, 17.152098,

# 위 값들중 가장 작은 순서대로 100개를 골라보자.
# 즉, apple_men 과 오차가 가장 작은 샘플 100개를 고르는 거다.

# np.argsort(): 오름차순 정렬한 abs_mean 배열의 '인덱스' 를 리턴함.
#   그 인덱스의 첫 100개를 선택해보면 된다!

np.argsort(abs_mean)
# >>> 출력:
# array([ 33,  48,  70,  57,  87,  12,  78,  59,   1,  74,  86,  38,  50,
#         92,  69,  27,  68,  30,  66,  24,  76,  98,  15,  84,  47,  90,
#          3,  94,  53,  23,  14,  71,  32,   7,  73,  36,  55,  77,  21,
#         10,  17,  39,  99,  95,  11,  35,  65,   6,  61,  22,  56,  89,
#          2,  13,  80,   0,  97,   4,  58,  34,  40,  43,  75,  82,  54,
#         16,  31,  49,  93,  37,  63,  64,  41,  28,  67,  25,  96,   8,
#         83,  46,  19,  79,  72,   5,  85,  29,  20,  60,  81,   9,  45,
#         51,  88,  62,  91,  26,  52,  18,  44,  42, 110, 120, 141, 112,
#        124, 102, 109, 192, 140, 142, 183, 117, 101, 128, 179, 159, 184,
#        154, 188, 139, 165, 119, 158, 100, 111, 191, 107, 137, 182, 175,
#        129, 148, 155, 103, 157, 181, 193, 121, 177, 186, 106, 174, 127,
#        164, 156, 185, 189, 133, 152, 118, 169, 144, 136, 104, 105, 161,
#        149, 145, 166, 160, 131, 162, 198, 150, 122, 167, 138, 176, 115,
#        147, 151, 190, 135, 172, 187, 180, 113, 125, 130, 163, 178, 134,
#        170, 195, 199, 116, 197, 123, 143, 173, 196, 194, 108, 114, 171,

apple_index = np.argsort(abs_mean)[:100]

fig, axs = plt.subplots(10, 10, figsize=(10, 10))
for i in range(10):
  for j in range(10):
    axs[i, j].imshow(fruits[apple_index[i * 10 + j]], cmap='gray_r')
    axs[i, j].axis('off')

plt.show()

# ## 군집(clustering), 클러스터(cluster)
# 
# `군집 (clustering) : 비슷한 샘플끼리 그룹으로 모으는 작업`
# 
# `클러스터 (cluster) : 군집 알고리즘에서 만든 그룹`

# 하지만!
#  우리는 사과, 파인애플, 바나나가 있었다는 사실 알고 있었다...  (사실 타겟값 알고 있었다.)

# 실제 y 값을 모르는 비지도 학습에선 위와 같이 샘플의 평균값을 미리 구할수 없다!

# K-means (K평균) 알고리즘으로 통해 해결해보자!

# # K-means 알고리즘

# k-평균 (k-means) 군집 알고리즘을 사용하면 '평균값' 을 자동으로 찾아줍니다.

# '평균값' 은 클러스터의 중심에 위치하기 때문에
#     '클러스터 중심 (cluster center)' 또는 센트로이드 (centroid) 라고도 한다

# # k-평균 알고리즘 소개

# k-평균 알고리즘의 작동방식

# 1. 무작위로 k개의 '클러스터 중심'을 정합니다.
# 2. 각 샘플에서 가장 가까운 클러스터 중심을 찾아 해당 클러스터의 샘플로 지정합니다.
# 3. 클러스터에 속한 샘플의 평균값으로 클러스터 중심을 변경합니다
# 4. 클러스터 중심에 변화가 없을 때까지 2번으로 돌아가 반복합니다.

# # KMeans

# k-평균 모델을 훈련하기 위해
# (샘플개수, 높이, 너비) 크기의 3차원 배열을
# → (샘플개수, 높이x너비) 크기를 가진 2차원 배열로 변경합니다

fruits_2d = fruits.reshape(-1, 100 * 100)

fruits_2d.shape
# >>> 출력:
# (300, 10000)

from sklearn.cluster import KMeans

# https://scikit-learn.org/stable/modules/generated/sklearn.cluster.KMeans.html
# 
# ```python
# class sklearn.cluster.KMeans(
#   n_clusters=8, # 클러스터 개수
#   *,
#   init='k-means++',
#   n_init='auto',
#   max_iter=300,
#   tol=0.0001,
#   verbose=0,
#   random_state=None,
#   copy_x=True,
#   algorithm='lloyd')
# ```

km = KMeans(n_clusters=3, random_state=42)
# 비지도 학습이므로 fit() 에 target 데이터 사용안함.
km.fit(fruits_2d)
# >>> 출력:
# KMeans(n_clusters=3, random_state=42)

# ## labels_  군집된 결과

# 군집된 결과는 labels_ 속성에 저장됩니다. (Array 배열)
# labels_ 배열의 길이는 샘플개수와 같습니다.
# 이 배열은 각 샘플이 어떤 레이블에 해당되는지 나타냅니다.
# n_clusters=3 으로 지정했기 때문에 labels_ 배열의 값은 0, 1, 2 중 하나입니다.

km.labels_
# >>> 출력:
# array([2, 2, 2, 2, 2, 0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 0, 2, 2, 2,
#        2, 2, 2, 2, 0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 0, 2,
#        0, 2, 2, 2, 2, 2, 2, 2, 0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 0, 0, 2, 2,
#        2, 2, 2, 2, 2, 2, 0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
#        2, 2, 2, 0, 2, 2, 2, 2, 2, 2, 2, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
#        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
#        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
#        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
#        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
#        0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
#        1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
#        1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
#        1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
#        1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1], dtype=int32)

# 0, 1, 2 cluster 로 모든 샘플의 개수 확인

np.unique(km.labels_, return_counts=True)
# >>> 출력:
# (array([0, 1, 2], dtype=int32), array([112,  98,  90]))

# 각 클러스터가 어떤 이미지(과일)를 나타내는지 출력하기 위한 도우미 함수

# draw_fruits 함수는
# arr (샘플개수, 높이, 너비) 의 3차원 배열을 입력받아 10개씩 이미지를 출력합니다
# ratio 는 그림그리는 figsize 크기 배율
def draw_fruits(arr, ratio=1):
  n = len(arr)   # n 은 샘플 개수

  # 샘플개수에 따라 행과 열의 개수 계산하고 figsize 지정함
  # 한 줄에 10개씩 이미지를 그립니다. 샘플 개수를 10으로 나누어 전체 행 개수를 계산합니다.
  rows = int(np.ceil(n/10))

  # 행이 1개뿐이면 열개수는 샘플개수(n) ,  행이 1보다 많으면 10개 열.
  cols = n if rows < 2 else 10

  fig, axs = plt.subplots(rows, cols,
                          figsize=(cols * ratio, rows * ratio),
                          squeeze=False   # (1, 2) -> (2,) <- 요렇게 차원 압축하지 않겠다는 뜻.
                          )

  # 이미지 그리기
  for i in range(rows):
    for j in range(cols):
      if i * 10 + j < n:    # 샘플개수(n) 까지만 그릴거다.
        axs[i, j].imshow(arr[i * 10 + j], cmap='gray_r')
      axs[i,j].axis('off')

  plt.show()

# 레이블이 0 인 과일들
fruits[km.labels_ == 0]
# >>> 출력:
# array([[[1, 1, 1, ..., 1, 1, 1],
#         [1, 1, 1, ..., 1, 1, 1],
#         [1, 1, 1, ..., 1, 1, 1],
#         ...,
#         [1, 1, 1, ..., 1, 1, 1],
#         [1, 1, 1, ..., 1, 1, 1],
#         [1, 1, 1, ..., 1, 1, 1]],
# 
#        [[1, 1, 1, ..., 1, 1, 1],
#         [1, 1, 1, ..., 1, 1, 1],
#         [1, 1, 1, ..., 1, 1, 1],
#         ...,
#         [1, 1, 1, ..., 1, 1, 1],
#         [1, 1, 1, ..., 1, 1, 1],
#         [1, 1, 1, ..., 1, 1, 1]],

draw_fruits(fruits[km.labels_ == 0])

draw_fruits(fruits[km.labels_ == 1])

draw_fruits(fruits[km.labels_ == 2])

"""
↑ 레이블이 1인 클러스터는 바나나로만 이루어져 있습니다.
하지만 레이블이 2인 클러스터는 파인애플에 사과9개와 바나나2개가 섞여 있네요.
k-평균 알고리즘이 이 샘플들을 완벽하게 구별해내지는 못했습니다.
하지만, 훈련데이터에 타켓 레이블을 전혀 제공하지 않았슴에도
'스스로' 비슷한 샘플들을 아주 잘 모은거 같다.
"""
None

# ## cluster_centers_  클러스터 중심

# cluster_centers_  배열은 fruits_2d 샘플의 클러스터 중심이기 때문에 이미지 출력하려면 100 x 100 으로 바꿔야 함.

km.cluster_centers_.shape  # (3, 10000)
# >>> 출력:
# (3, 10000)

# 클러스터 중심을 시각화
draw_fruits(km.cluster_centers_.reshape(-1, 100, 100), ratio=3)

# ↑ Kmeans 가 찾아낸 평균값이다. <--  우리가 아까 계산한 평균값과 매우 비슷하다!

# ## transform()
# 훈련데이터 샘플에서 클러스터 중심까지 거리로 변환

# transform() :  훈련데이터 샘플에서 클러스터 중심까지 거리로 변환해 준다.
# 인덱스 100 인 샘플을 transform 적용해볼거다

fruits_2d[100].shape  # (10000,)   -> 이를 transform() 에 적용하려면 2차원 배열 형태로 변환해야 한다. (1, 10000)
# >>> 출력:
# (10000,)

fruits_2d[100:101].shape
# >>> 출력:
# (1, 10000)

km.transform(fruits_2d[100:101])
# >>> 출력:
# array([[3400.24197319, 8837.37750892, 5279.33763699]])

# 하나의 샘플 전달 -> 리턴된 배열 (1, 클러스터 개수)
# 각각의 클러스터 까지의 거리

# 가장 가까운 클러스터까지의 거리가 3400 정도.  (레이블 0)  <- 실행할때마다 달라질수 있다.

# ## predict()
# 가장 가까운 클러스 중심을 예측 클래스로 출력

km.predict(fruits_2d[100:101])
# >>> 출력:
# array([0], dtype=int32)

draw_fruits(fruits[100:101])

# ## n_iter= 속성
# '클러스터 중심' 이동을 반복했던 횟수

# k-평균 알고리즘은 앞에서 설명했듯이 반복적으로 클러스터 중심을 옮기면서 최적의 클러스터를 찾습니다.
# 알고리즘이 반복한 횟수는 KMeans 클래스의 n_iter_ 속성에 저장됩니다.

km.n_iter_
# >>> 출력:
# 4

# # 최적의 k 찾기

# ## n_clusters= 를 어떻게 지정?

# n_clusters=3 으로 지정했다? <- 이미 타겟에 대한 정보를 활용한 셈이다...

# 실전의 데이터는 이러한 정보도 없을것이다.
# 과연 최적의 클러스터 개수는 어떻게 지정할 것인가?

# 대표적인 방법중 하나 elbow (엘보우) 방법이 있다.

# ## inertia (이너셔)

# k-평균 알고리즘은 '클러스터 중심' 과 클러스터에 속한 샘플 사이의 거리를 잴 수 있다.
# 이 거리의 제곱 합을 이너셔 (inertia) 라 한다
# 이너셔는 클러스터에 속한 샘플이 얼마나 가깝게 모여 있는지 나타내는 값으로 활용할수 있다.

# 일반적으로 클러스터 개수가 늘어나면 클러스터 개개의 크기는 줄어들기 때문에 이너셔도 줄어듭니다.

# ## 엘보우 (elbow) 방법

# 엘보우 방법 : 클러스터의 개수를 늘려가면서
#             이니셔의 변화를 관찰하여 최적의 클러스터 개수를 찾는 방법

# 클러스터 개수를 증가시키면서 이너셔를 그래프로 그리면 감소하는 속도가 꺽이는 지점이 있다
# 이 지점부터는 클러스터 개수를 늘려도 클러스터에 잘 밀집된 정도가 크게 개선되지 않는다.

# ![](https://av-eks-blogoptimized.s3.amazonaws.com/62725cluster0.png)

# 클러스터 개수를 2 ~ 6까지 변경해가면서 훈련,  이너셔값 관찰

inertia = []
for k in range(2, 7):
  km = KMeans(n_clusters=k, random_state=42)
  km.fit(fruits_2d)
  inertia.append(km.inertia_)   # .inertia_ 속성에 이너셔값이 계산되어 있다.

plt.plot(range(2, 7), inertia)
plt.xlabel('k')
plt.ylabel('inertia')
plt.show()

# ↑ 꺽이는 지점이 뚜렷하진 않지만 k=3 에서 기울기가 둔화된다.
#  최적의 k값은 3으로 판단할수 있다.
