print("Hello Python")
# >>> 출력:
# Hello Python

print("Good Morning")
print(1000)
print(55 - 31)
print(3.14 + 1.1)
# >>> 출력:
# Good Morning
# 1000
# 24
# 4.24

"Good Morning"
# >>> 출력:
# 'Good Morning'

100 + 200 - 10
# >>> 출력:
# 290

300 * 5
# >>> 출력:
# 1500

800 / 4
# >>> 출력:
# 200.0

10 * (4 - 2)
# >>> 출력:
# 20

100 - 200
# >>> 출력:
# -100

print("Good Morning")
print(1000)
print(55 - 31)
print(3.14 + 1.1)
# >>> 출력:
# Good Morning
# 1000
# 24
# 4.24

"안녕하세요 여러분!"
# >>> 출력:
# '안녕하세요 여러분!'

"안녕하세요 여러분!"
# >>> 출력:
# '안녕하세요 여러분!'

800 / (4 - 2)
# >>> 출력:
# 400.0

10 * (4 - 2)
# >>> 출력:
# 20

100 - 200
# >>> 출력:
# -100

# 안녕하세요 텍스트 셀입니다

20 - 40
# >>> 출력:
# -20
