# # NumPy
# **Num**erical **Py**thon
# 
# <img src="https://numpy.org/images/logo.svg" width="100" height="100"/>
# 
# [공식] (https://numpy.org/)

# numpy : 수치적 연산을 위해 최적화된 모듈
#  파이썬을 활용한 데이터 분석에서  가장 기본!
#  이 자체로도 많이 쓰이거니와, 앞으로 배울 pandas, 머신러닝 등 수많은 분야에서 기본적으로 사용하는 모듈
#  파이썬 개발자라면 꼭 익힐 필요 있다

# 수학수치 연산  (numerical python) / 합, 평균, 행렬연산 등..
# 추가적으로 scipy, statsmodel  같은 것들도 numpy 기반으로 구현됨.
# 상황에 따라, pandas 안써도 numpy 만으로도 가능.

# 기본 타입 : ndarray  (n-dimensional array) 다차원 배열 표현

# 파이썬에 list 가 있는데 굳이? 왜?  -

# numpy 를 사용하는 이유
# 1. 성능 : 성능적으로 훨~씬 빠름.
# 2. 메모리 : 훨씩 적은 메모리사용
# 3. 제공함수풍부 : 선형대수, 통계관련 여러 수치함수 제공
# 4. 수많은 모듈에서 numpy 함수명 과 기능을 그대로 사용.

import numpy as np

# ![aaa](https://statkclee.github.io/deep-learning/fig/tensor.jpg)
# 
# **Scalar** : 0차원 array (단일값)
# 
# **Vector** : 1차원 array
# 
# **Matrix** : 2차원 array
# 
# **Tensor** : 3차원(이상) array

# # 1차원 array (벡터) 생성

# np.array(iterable)

x = np.array([1, 2, 3])
y = np.array([2, 4, 15])

x
# >>> 출력:
# array([1, 2, 3])

y
# >>> 출력:
# array([ 2,  4, 15])

print(y)
# >>> 출력:
# [ 2  4 15]

# scalar (0 차원)
np.array(10)
# >>> 출력:
# array(10)

type(x)
# >>> 출력:
# numpy.ndarray

[1, 2, 3.14, '김', True]  # list 는 원소타입이 제각각 가능!
# >>> 출력:
# [1, 2, 3.14, '김', True]

# 그러나!  array 는 모든 원소는 '한가지 타입' 이어야 함!

# # shape, size, ndim, dtype, len()

arr = np.array([1, 2, 3, 4, 5])
arr
# >>> 출력:
# array([1, 2, 3, 4, 5])

# ## shape
# numpy에서는 해당 array의 크기를 알 수 있다.<br>
# shape 을 확인함으로써 몇개의 데이터가 있는지, 몇 차원으로 존재하는지 등을 확인할 수 있다.<br>
# 위에서 arr1.shape의 결과는 (5,) 으로써, 1차원의 데이터이며 총 5라는 크기를 갖고 있음을 알 수 있다.
# arr4.shape의 결과는 (4,3) 으로써, 2차원의 데이터이며 4 * 3 크기를 갖고 있는 array 이다.

arr.shape   # tuple

# (5,)  <-- 숫자의 개수는 차원.
# 차원의 크기는 5
# >>> 출력:
# (5,)

# ## ndim  차원

arr.ndim  # 몇 차원 데이터인지?

# .ndim 과 len(arr.shape) 은 같다!
# >>> 출력:
# 1

# ## size: 데이터 개수

arr
# >>> 출력:
# array([1, 2, 3, 4, 5])

arr.size
# >>> 출력:
# 5

# ## len(array)
# - array 는 iterable 하다!

len(arr)
# >>> 출력:
# 5

# ## dtype: data type

arr.dtype

# dtype('int64')  정수 64bit (8byte)
# >>> 출력:
# dtype('int64')

arr2 = np.array([10, 3.14, 2, 0.12])
arr2
# >>> 출력:
# array([10.  ,  3.14,  2.  ,  0.12])

arr2.dtype
# >>> 출력:
# dtype('float64')

# numpy에서 사용되는 자료형은 아래와 같다. (자료형 뒤에 붙는 숫자는 몇 비트 크기인지를 의미한다.)

# 부호가 있는 정수 int(8, 16, 32, 64)
# 부호가 없는 정수 uint(8 ,16, 32, 64)
# 실수 float(16, 32, 64, 128)
# 복소수 complex(64, 128, 256)
# 불리언 bool
# 문자열 string_
# 파이썬 오프젝트 object
# 유니코드 unicode_

# # 2차원 array 생성

x = np.array([1, 2, 3, 4])
y = np.array([[2, 3, 4], [1, 2, 4]])

x
# >>> 출력:
# array([1, 2, 3, 4])

y
# >>> 출력:
# array([[2, 3, 4],
#        [1, 2, 4]])

x.shape
# >>> 출력:
# (4,)

y.shape
# >>> 출력:
# (2, 3)

x.ndim
# >>> 출력:
# 1

y.ndim
# >>> 출력:
# 2

len(x)
# >>> 출력:
# 4

len(y) #
# >>> 출력:
# 2

x.size
# >>> 출력:
# 4

y.size
# >>> 출력:
# 6

# # 3차원 array

# 2 x 3 x 4

z = np.array([
      [
          [1, 2, 3, 4],
          [5, 6, 7, 8],
          [9, 10, 11, 12]
      ],
      [
          [101, 102, 103, 104],
          [201, 202, 203, 204],
          [301, 302, 303, 304]
      ],
    ])

z
# >>> 출력:
# array([[[  1,   2,   3,   4],
#         [  5,   6,   7,   8],
#         [  9,  10,  11,  12]],
# 
#        [[101, 102, 103, 104],
#         [201, 202, 203, 204],
#         [301, 302, 303, 304]]])

z.shape
# >>> 출력:
# (2, 3, 4)

z.size
# >>> 출력:
# 24

# # 같은 값이라도 '차원' 이 다를 수 있다
# '차원변환' 중요하다!

np.array(10)  # scalar 0 차원
# >>> 출력:
# array(10)

np.array([10]) # 1차원
# >>> 출력:
# array([10])

np.array([[10]]) # 2차원
# >>> 출력:
# array([[10]])

np.array([[[10]]]) # 3차원
# >>> 출력:
# array([[[10]]])

# # np.arange()
# - range() 와 유사

np.arange(10)
# >>> 출력:
# array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

np.arange(1, 10)
# >>> 출력:
# array([1, 2, 3, 4, 5, 6, 7, 8, 9])

np.arange(1, 10, 2)
# >>> 출력:
# array([1, 3, 5, 7, 9])

np.arange(10, 0, -1)
# >>> 출력:
# array([10,  9,  8,  7,  6,  5,  4,  3,  2,  1])

np.arange(1, 10, dtype=np.int16)
# >>> 출력:
# array([1, 2, 3, 4, 5, 6, 7, 8, 9], dtype=int16)

# # astype(타입)
# 타입변환한 array 를 리턴 (원본 변화 없슴!)

d = np.arange(3, 10)
d   # dtype=int64
# >>> 출력:
# array([3, 4, 5, 6, 7, 8, 9])

d.astype(np.float32)
# >>> 출력:
# array([3., 4., 5., 6., 7., 8., 9.], dtype=float32)

d
# >>> 출력:
# array([3, 4, 5, 6, 7, 8, 9])

# # reshape()
#  - ndarray의 형태, 차원을 바꾸기 위해 사용
#  - 머신러닝, 데이터 프로세싱에서 매우 자주 사용됨. (차원변환)

np.arange(12).reshape(2, 6)  # (12,) -> (2, 6)
# >>> 출력:
# array([[ 0,  1,  2,  3,  4,  5],
#        [ 6,  7,  8,  9, 10, 11]])

# np.arange(12).reshape(2, 4)  # size 맞지 않으면 에러!

np.arange(12).reshape(3, 2, 2)
# >>> 출력:
# array([[[ 0,  1],
#         [ 2,  3]],
# 
#        [[ 4,  5],
#         [ 6,  7]],
# 
#        [[ 8,  9],
#         [10, 11]]])

# # np.ones, np.zeros

np.ones(5)  # dtype=float64
# >>> 출력:
# array([1., 1., 1., 1., 1.])

np.ones(6).reshape(2, 3)
# >>> 출력:
# array([[1., 1., 1.],
#        [1., 1., 1.]])

np.ones((2, 3), dtype=np.int16)
# >>> 출력:
# array([[1, 1, 1],
#        [1, 1, 1]], dtype=int16)

np.zeros((3, 2, 5), dtype=np.uint8)
# >>> 출력:
# array([[[0, 0, 0, 0, 0],
#         [0, 0, 0, 0, 0]],
# 
#        [[0, 0, 0, 0, 0],
#         [0, 0, 0, 0, 0]],
# 
#        [[0, 0, 0, 0, 0],
#         [0, 0, 0, 0, 0]]], dtype=uint8)

# 단위 행렬
np.eye(5)  # (5, 5) 단위 행렬
# >>> 출력:
# array([[1., 0., 0., 0., 0.],
#        [0., 1., 0., 0., 0.],
#        [0., 0., 1., 0., 0.],
#        [0., 0., 0., 1., 0.],
#        [0., 0., 0., 0., 1.]])

# # np.random 서브모듈

# rand: 0부터 1사이의 균일 분포 [0, 1)  uniform distribution
# randn: 가우시안 표준 정규 분포
# randint: 균일 분포의 정수 난수

np.random.rand(10)
# >>> 출력:
# array([0.36225666, 0.11397988, 0.50474019, 0.03411071, 0.19025583,
#        0.34636266, 0.38039681, 0.35858553, 0.73228649, 0.61379254])

np.random.rand(2, 3)  # (2, 3)
# >>> 출력:
# array([[0.32282736, 0.60947299, 0.33303293],
#        [0.43310106, 0.44160717, 0.74994519]])

# ![](https://thebook.io/img/080263/218.jpg)

np.random.randn(5)
# >>> 출력:
# array([-1.61002012,  0.46509716, -0.51439199,  0.92066965, -0.21958638])

np.random.randint(5)   # 0 ~ 4 사이의 정수 난수
# >>> 출력:
# 2

np.random.randint(1, 10)  # [1, 10)
# >>> 출력:
# 9

np.random.randint(1, 100, (3, 5, 2))
# >>> 출력:
# array([[[68, 95],
#         [83, 89],
#         [90, 78],
#         [62, 57],
#         [69, 58]],
# 
#        [[72,  8],
#         [53, 94],
#         [61, 55],
#         [82,  2],
#         [30, 54]],
# 
#        [[57, 71],
#         [54, 25],
#         [13, 97],

# seed() : 난수를 예측가능하도록 만든다.  실행할때마다 동일한 난수가 발생되도록 함.
np.random.seed(0)
np.random.rand(4)
# >>> 출력:
# array([0.5488135 , 0.71518937, 0.60276338, 0.54488318])

np.random.seed(1)
np.random.rand(4)
# >>> 출력:
# array([4.17022005e-01, 7.20324493e-01, 1.14374817e-04, 3.02332573e-01])

# # np.unique()

np.unique([11, 11, 2, 2, 34, 34])
# >>> 출력:
# array([ 2, 11, 34])

# # 인덱싱 index
#  - 파이썬 리스트와 동일한 개념으로 사용
#  - ,를 사용하여 각 차원의 인덱스에 접근 가능
#  - 인덱싱 할때마다 차원감소

x = np.arange(10)
x
# >>> 출력:
# array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

x[0]
# >>> 출력:
# 0

x[-1], x[9]
# >>> 출력:
# (9, 9)

x[3] = 100
x
# >>> 출력:
# array([  0,   1,   2, 100,   4,   5,   6,   7,   8,   9])

x = np.arange(10).reshape(2, 5)
x # 2차원
# >>> 출력:
# array([[0, 1, 2, 3, 4],
#        [5, 6, 7, 8, 9]])

x[0]  # 1차원
# >>> 출력:
# array([0, 1, 2, 3, 4])

x[0][2]  # 0차원
# >>> 출력:
# 2

x[0, 2] # <- 콤마로 인덱싱 가능!  numpy 에선 후자의 방법을 추천!
# >>> 출력:
# 2

x
# >>> 출력:
# array([[0, 1, 2, 3, 4],
#        [5, 6, 7, 8, 9]])

x[1, 4], x[1, -1], x[-1, -1]
# >>> 출력:
# (9, 9, 9)

# ## Advanced Indexing
# - Integer array indexing

x
# >>> 출력:
# array([[0, 1, 2, 3, 4],
#        [5, 6, 7, 8, 9]])

x[0]
# >>> 출력:
# array([0, 1, 2, 3, 4])

x[[0]]
# >>> 출력:
# array([[0, 1, 2, 3, 4]])

x[[1, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0]]
# >>> 출력:
# array([[5, 6, 7, 8, 9],
#        [0, 1, 2, 3, 4],
#        [0, 1, 2, 3, 4],
#        [0, 1, 2, 3, 4],
#        [0, 1, 2, 3, 4],
#        [5, 6, 7, 8, 9],
#        [5, 6, 7, 8, 9],
#        [5, 6, 7, 8, 9],
#        [5, 6, 7, 8, 9],
#        [0, 1, 2, 3, 4],
#        [0, 1, 2, 3, 4],
#        [0, 1, 2, 3, 4]])

# # 슬라이싱
#  - 리스트, 문자열 slicing과 동일한 개념으로 사용
#  - ,를 사용하여 각 차원 별로 슬라이싱 가능
#  - 슬라이싱은 차원 변화 없다

x = np.arange(10)
x
# >>> 출력:
# array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

x[1:7]
# >>> 출력:
# array([1, 2, 3, 4, 5, 6])

x[1:]
# >>> 출력:
# array([1, 2, 3, 4, 5, 6, 7, 8, 9])

x[:]
# >>> 출력:
# array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

x[::2]
# >>> 출력:
# array([0, 2, 4, 6, 8])

x[1::3]
# >>> 출력:
# array([1, 4, 7])

x[::-1]
# >>> 출력:
# array([9, 8, 7, 6, 5, 4, 3, 2, 1, 0])

y = [[0, 1, 2, 3, 4],
     [5, 6, 7, 8, 9],
     [10, 11, 12, 13, 14]]
y
# >>> 출력:
# [[0, 1, 2, 3, 4], [5, 6, 7, 8, 9], [10, 11, 12, 13, 14]]

y[0:1]
# >>> 출력:
# [[0, 1, 2, 3, 4]]

y[1:3]
# >>> 출력:
# [[5, 6, 7, 8, 9], [10, 11, 12, 13, 14]]

y[:2]
# >>> 출력:
# [[0, 1, 2, 3, 4], [5, 6, 7, 8, 9]]

y[:2][1:4]
# >>> 출력:
# [[5, 6, 7, 8, 9]]

# list 는 차원별 slicing 이 불가능하다!

x = np.arange(15).reshape(3, 5)
x
# >>> 출력:
# array([[ 0,  1,  2,  3,  4],
#        [ 5,  6,  7,  8,  9],
#        [10, 11, 12, 13, 14]])

x[:2][1:4]
# >>> 출력:
# array([[5, 6, 7, 8, 9]])

x[:2, 1:4]   # array 는 차원별 slicing 가능하다!
# >>> 출력:
# array([[1, 2, 3],
#        [6, 7, 8]])

# ---
# # shape (차원) 변경하기
# **차원변환**은 데이터분석 과 인공지능에서 매우 빈번하게 발생되는 작업이니만큼 자유자재로 변환할수 있어야 하고, 머리속으로 내가 변환하는 데이터의 구조가 그려지도록 익숙해져야 합니다
# 
# 사용 예) 이미지 데이터 벡터화 - 이미지는 기본적으로 2차원 혹은 3차원(RGB)이나 트레이닝을 위해 1차원으로 변경하여 사용 됨

# ## ravel(), np.ravel()
#   - [ˈrævl]
#   - 다차원배열을 1차원으로 변경 (흔히 **'펼친다'**라고 말함)
#   - 'order' 파라미터
#     - 'C' - row 우선 변경 ,   C style
#     - 'F - column 우선 변경,   Fortran style
#   - ravel() 은 np 안에 일반 함수로도 있고, 혹은 ndarray 의 멤버함수로서도 존재

x
# >>> 출력:
# array([[ 0,  1,  2,  3,  4],
#        [ 5,  6,  7,  8,  9],
#        [10, 11, 12, 13, 14]])

x.ravel()
# >>> 출력:
# array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14])

# np.ravel?

np.ravel(x, order='C')   # row 방향으로 펼쳐짐.  (axis 0 부터 펼쳐짐)
# >>> 출력:
# array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14])

np.ravel(x, order='F')   # column 방향으로 펼쳐짐 (axis -1 부터 펼쳐짐)
# >>> 출력:
# array([ 0,  5, 10,  1,  6, 11,  2,  7, 12,  3,  8, 13,  4,  9, 14])

# ## flatten()
#  - 다차원 배열을 1차원으로 변경
#  - ravel과의 차이점:
#      - copy를 생성하여 변경함(즉 원본 데이터가 아닌 복사본을 반환)
#      - ndarray 의 멤버함수로만 제공됨
#  - 'order' 파라미터
#    - 'C' - row 우선 변경
#    - 'F - column 우선 변경

y = np.arange(15).reshape(3, 5)
y
# >>> 출력:
# array([[ 0,  1,  2,  3,  4],
#        [ 5,  6,  7,  8,  9],
#        [10, 11, 12, 13, 14]])

y.flatten()
# >>> 출력:
# array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14])

temp = x.ravel()
temp
# >>> 출력:
# array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14])

temp[0] = 100
temp
# >>> 출력:
# array([100,   1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,
#         13,  14])

x
# >>> 출력:
# array([[100,   1,   2,   3,   4],
#        [  5,   6,   7,   8,   9],
#        [ 10,  11,  12,  13,  14]])

temp2 = y.flatten()   # '데이터' 의 '복사본' 을 생성함.
temp2
# >>> 출력:
# array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14])

temp2[0] = 100
temp2
# >>> 출력:
# array([100,   1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,
#         13,  14])

y  # 원본데이터에는 변화 없다.
# >>> 출력:
# array([[ 0,  1,  2,  3,  4],
#        [ 5,  6,  7,  8,  9],
#        [10, 11, 12, 13, 14]])

# ## reshape 함수
#  - array의 shape을 다른 차원으로 변경
#  - 주의할점은 reshape한 후의 결과의 전체 원소 개수와 이전 개수가 같아야 가능
#  - 사용 예) 이미지 데이터 벡터화 - 이미지는 기본적으로 2차원 혹은 3차원(RGB)이나 트레이닝을 위해 1차원으로 변경하여 사용 됨
#  - **-1** 값을 주어 나머지 차원을 유추하게 할수 있다

x2 = np.arange(36)
x2
# >>> 출력:
# array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16,
#        17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33,
#        34, 35])

x2.reshape(6, 6)
# >>> 출력:
# array([[ 0,  1,  2,  3,  4,  5],
#        [ 6,  7,  8,  9, 10, 11],
#        [12, 13, 14, 15, 16, 17],
#        [18, 19, 20, 21, 22, 23],
#        [24, 25, 26, 27, 28, 29],
#        [30, 31, 32, 33, 34, 35]])

x2.reshape(6, -1)  # -1 의 차원 크기가 유추되어 reshape 된다 => (6,6)
# >>> 출력:
# array([[ 0,  1,  2,  3,  4,  5],
#        [ 6,  7,  8,  9, 10, 11],
#        [12, 13, 14, 15, 16, 17],
#        [18, 19, 20, 21, 22, 23],
#        [24, 25, 26, 27, 28, 29],
#        [30, 31, 32, 33, 34, 35]])

x2.reshape(6, -1, 2) # => (6, 3, 2)
# >>> 출력:
# array([[[ 0,  1],
#         [ 2,  3],
#         [ 4,  5]],
# 
#        [[ 6,  7],
#         [ 8,  9],
#         [10, 11]],
# 
#        [[12, 13],
#         [14, 15],
#         [16, 17]],
# 
#        [[18, 19],
#         [20, 21],
#         [22, 23]],

# ## 차원 확장 / 제거
# 
# - 차원 확장/제거 하는 동작도 머신러닝에서 많이 사용된다.
# - **reshape()** 로 차원 변환(확장/제거) 자유롭게 가능
# 
# ## 차원 확장 : np.expand_dims()
# - axis로 지정된 '차원을 추가'한다.
# 
# 
# ## 차원 자동 제거 : squeeze, np.squeeze()
# 
# - 차원 중 사이즈가 1인 것을 찾아 스칼라값으로 바꿔 해당 '차원을 제거'한다.

x3 = np.arange(6)
x3
# >>> 출력:
# array([0, 1, 2, 3, 4, 5])

x3.shape
# >>> 출력:
# (6,)

x3 = x3.reshape(6, 1)  # (6,) => (6, 1)  로 차원 확장
x3
# >>> 출력:
# array([[0],
#        [1],
#        [2],
#        [3],
#        [4],
#        [5]])

x3.shape
# >>> 출력:
# (6, 1)

x3 = x3.reshape(6, 1, 1)
x3
# >>> 출력:
# array([[[0]],
# 
#        [[1]],
# 
#        [[2]],
# 
#        [[3]],
# 
#        [[4]],
# 
#        [[5]]])

x3 = x3.reshape((6,))  # 1차원으로 축소  (차원 제거)
x3
# >>> 출력:
# array([0, 1, 2, 3, 4, 5])

x3 = x3.reshape(1, 1, 1, 6)
x3
# >>> 출력:
# array([[[[0, 1, 2, 3, 4, 5]]]])

x3.squeeze()  # 차원크기가 1인 차원을 제거. => (6,)
# >>> 출력:
# array([0, 1, 2, 3, 4, 5])

x4 = np.arange(4).reshape((2, 1, 2))
x4
# >>> 출력:
# array([[[0, 1]],
# 
#        [[2, 3]]])

x4.squeeze() # (2, 1, 2) => (2, 2)
# >>> 출력:
# array([[0, 1],
#        [2, 3]])

x5 = np.arange(3)  # (3,)
x5
# >>> 출력:
# array([0, 1, 2])

y5 = np.expand_dims(x5, axis=0)  # 0번째 차원축(axis) 에 새로운 차원 추가(삽입)
y5
# >>> 출력:
# array([[0, 1, 2]])

y5.shape
# >>> 출력:
# (1, 3)

x6 = np.arange(4).reshape(2, 2)
x6
# >>> 출력:
# array([[0, 1],
#        [2, 3]])

# (2, 2) => (2, 2, 1)

y7 = np.expand_dims(x6, axis=-1)
print(y7.shape)
y7
# >>> 출력:
# (2, 2, 1)
# array([[[0],
#         [1]],
# 
#        [[2],
#         [3]]])

a = np.array([2, 0, 1, 8])
a
# >>> 출력:
# array([2, 0, 1, 8])

# (4,) => (1, 4)
a1 = a[np.newaxis, :]
print(a1.shape)
a1
# >>> 출력:
# (1, 4)
# array([[2, 0, 1, 8]])

# ↑ 1차원 벡터를 'row vector' 로 변환한다 라고도 함.

a2 = a[:, np.newaxis]  # (4,) => (4, 1)
print(a2.shape)
a2
# >>> 출력:
# (4, 1)
# array([[2],
#        [0],
#        [1],
#        [8]])

# ↑ 1차원 벡터를 'column vector' 로 변환한다 라고도 함.

# # transpose, T,  swapaxes
# 전치행렬 (transpose matrix) , 차원 축 바꾸기
# 
# ![](https://img1.daumcdn.net/thumb/R1280x0/?scode=mtistory2&fname=https%3A%2F%2Fblog.kakaocdn.net%2Fdn%2FbtmNz3%2FbtqDk6Xy5nh%2FD7U80E2R3fnahK00cijoY1%2Fimg.png)

a = np.arange(15).reshape(3, 5)
a
# >>> 출력:
# array([[ 0,  1,  2,  3,  4],
#        [ 5,  6,  7,  8,  9],
#        [10, 11, 12, 13, 14]])

np.transpose(a)  # (3, 5) => (5, 3)
# >>> 출력:
# array([[ 0,  5, 10],
#        [ 1,  6, 11],
#        [ 2,  7, 12],
#        [ 3,  8, 13],
#        [ 4,  9, 14]])

a.T
# >>> 출력:
# array([[ 0,  5, 10],
#        [ 1,  6, 11],
#        [ 2,  7, 12],
#        [ 3,  8, 13],
#        [ 4,  9, 14]])

np.swapaxes(a, 0, 1)   # axis 0 과 axis 1 을 바꾸기
# >>> 출력:
# array([[ 0,  5, 10],
#        [ 1,  6, 11],
#        [ 2,  7, 12],
#        [ 3,  8, 13],
#        [ 4,  9, 14]])

# # 기본연산, 기본함수

x = np.arange(15).reshape(3, 5)
y = np.arange(0, 150, 10).reshape(3, 5)
y2 = np.random.rand(15).reshape(3, 5)
y3 = np.arange(15).reshape(5, 3)

x
# >>> 출력:
# array([[ 0,  1,  2,  3,  4],
#        [ 5,  6,  7,  8,  9],
#        [10, 11, 12, 13, 14]])

y
# >>> 출력:
# array([[  0,  10,  20,  30,  40],
#        [ 50,  60,  70,  80,  90],
#        [100, 110, 120, 130, 140]])

y2
# >>> 출력:
# array([[0.14675589, 0.09233859, 0.18626021, 0.34556073, 0.39676747],
#        [0.53881673, 0.41919451, 0.6852195 , 0.20445225, 0.87811744],
#        [0.02738759, 0.67046751, 0.4173048 , 0.55868983, 0.14038694]])

y3
# >>> 출력:
# array([[ 0,  1,  2],
#        [ 3,  4,  5],
#        [ 6,  7,  8],
#        [ 9, 10, 11],
#        [12, 13, 14]])

# ## array 간 연산

# 리스트의 경우
a = [10, 20, 30, 40]
b = 2
c = [100, 200, 300, 400]

a * 2
# >>> 출력:
# [10, 20, 30, 40, 10, 20, 30, 40]

# a + b

a + c
# >>> 출력:
# [10, 20, 30, 40, 100, 200, 300, 400]

# array 연산은 리스트와 다르다!
# 기본적으로 '원소' 끼리 연산

x + y
# >>> 출력:
# array([[  0,  11,  22,  33,  44],
#        [ 55,  66,  77,  88,  99],
#        [110, 121, 132, 143, 154]])

x - y
# >>> 출력:
# array([[   0,   -9,  -18,  -27,  -36],
#        [ -45,  -54,  -63,  -72,  -81],
#        [ -90,  -99, -108, -117, -126]])

# array 와 스칼라 값 연산 가능
x + 10
# >>> 출력:
# array([[10, 11, 12, 13, 14],
#        [15, 16, 17, 18, 19],
#        [20, 21, 22, 23, 24]])

# 단일값만 갖고 있는 객체와는 shape 관계없이, scalar 연산 수행
x + [10]
# >>> 출력:
# array([[10, 11, 12, 13, 14],
#        [15, 16, 17, 18, 19],
#        [20, 21, 22, 23, 24]])

x + [[10]]
# >>> 출력:
# array([[10, 11, 12, 13, 14],
#        [15, 16, 17, 18, 19],
#        [20, 21, 22, 23, 24]])

x + np.array(10)
# >>> 출력:
# array([[10, 11, 12, 13, 14],
#        [15, 16, 17, 18, 19],
#        [20, 21, 22, 23, 24]])

x + np.array([10])
# >>> 출력:
# array([[10, 11, 12, 13, 14],
#        [15, 16, 17, 18, 19],
#        [20, 21, 22, 23, 24]])

x
# >>> 출력:
# array([[ 0,  1,  2,  3,  4],
#        [ 5,  6,  7,  8,  9],
#        [10, 11, 12, 13, 14]])

# x + np.array([10, 20])

# ValueError: operands could not be broadcast together with shapes (3,5) (2,)

# # axis (차원축)

"""
numpy 의 많은 함수들은 axis=  파라미터를 갖고 있습니다.
axis (축) 은 각 '차원' 을 의미합니다.
1차원 array 라면  각 차원에 대한 axis 값은 0  <- 1개 입니다.
2차원 array 라면  각 차원에 대한 axis 값은 0, 1  <- 2개 입니다.
3차원 array 라면  각 차원에 대한 axis 값은 0, 1, 2  <- 3개 입니다.

axis= 값을 명시하면 그 함수의 연산 은 해당 axis(축) 에 '따라서' 연산을 수행함

과연 '따라서' 의 의미가 무엇인지 실습을 통해 이해해봅시다
"""
None

x1 = np.arange(15)
x1
# >>> 출력:
# array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14])

np.sum(x1)
# >>> 출력:
# 105

np.sum(x1, axis=None)
# >>> 출력:
# 105

x2 = x1.reshape(3, 5)
x2
# >>> 출력:
# array([[ 0,  1,  2,  3,  4],
#        [ 5,  6,  7,  8,  9],
#        [10, 11, 12, 13, 14]])

x2.shape

# (행, 열)
# (axis 0, axis 1)
# >>> 출력:
# (3, 5)

np.sum(x2)  # axis=None
# >>> 출력:
# 105

x2
# >>> 출력:
# array([[ 0,  1,  2,  3,  4],
#        [ 5,  6,  7,  8,  9],
#        [10, 11, 12, 13, 14]])

np.sum(x2, axis=0)  # (3, 5) => (5,)

# 15 = 0 + 5 + 10
#      [0,0] + [1, 0] + [2, 0]
# >>> 출력:
# array([15, 18, 21, 24, 27])

np.sum(x2, axis=1)  # (3, 5) => (3,)
# >>> 출력:
# array([10, 35, 60])

np.sum(x2, axis=-1)
# >>> 출력:
# array([10, 35, 60])

y = np.random.rand(15).reshape(3, 5)
y
# >>> 출력:
# array([[0.19810149, 0.80074457, 0.96826158, 0.31342418, 0.69232262],
#        [0.87638915, 0.89460666, 0.08504421, 0.03905478, 0.16983042],
#        [0.8781425 , 0.09834683, 0.42110763, 0.95788953, 0.53316528]])

np.max(y)
# >>> 출력:
# 0.9682615757193975

np.argmax(y)  # 최댓값의 index
# >>> 출력:
# 2

np.max(y, axis=0)
# >>> 출력:
# array([0.8781425 , 0.89460666, 0.96826158, 0.95788953, 0.69232262])

np.argmax(y, axis=0)
# >>> 출력:
# array([2, 1, 0, 2, 0])

# # Broadcasting
# #### 브로드캐스팅
#   - (기본적으로는) Shape이 같은 두 ndarray에 대한 연산은 각 원소별로 진행
#   - **다른 Shape을 갖는 array 간 연산** 의 경우 브로드 캐스팅(Shape을 맞춤) 후 진행
#     
#     
# ![](https://numpy.org/doc/stable/_images/broadcasting_1.png)

x = np.arange(15).reshape(3, 5)
x
# >>> 출력:
# array([[ 0,  1,  2,  3,  4],
#        [ 5,  6,  7,  8,  9],
#        [10, 11, 12, 13, 14]])

y = np.random.rand(15).reshape(3, 5)
y
# >>> 출력:
# array([[0.69187711, 0.31551563, 0.68650093, 0.83462567, 0.01828828],
#        [0.75014431, 0.98886109, 0.74816565, 0.28044399, 0.78927933],
#        [0.10322601, 0.44789353, 0.9085955 , 0.29361415, 0.28777534]])

x + y
# >>> 출력:
# array([[ 0.69187711,  1.31551563,  2.68650093,  3.83462567,  4.01828828],
#        [ 5.75014431,  6.98886109,  7.74816565,  8.28044399,  9.78927933],
#        [10.10322601, 11.44789353, 12.9085955 , 13.29361415, 14.28777534]])

a = np.arange(12).reshape(4, 3)
b = np.arange(100, 103)

  # (4, 3)
# >>> 출력:
# array([[ 0,  1,  2],
#        [ 3,  4,  5],
#        [ 6,  7,  8],
#        [ 9, 10, 11]])

b  # (3,)
# >>> 출력:
# array([100, 101, 102])

a + b
# >>> 출력:
# array([[100, 102, 104],
#        [103, 105, 107],
#        [106, 108, 110],
#        [109, 111, 113]])

# ### 브로드캐스팅 Rule
#  - [Rule 공식문서](https://docs.scipy.org/doc/numpy/user/basics.broadcasting.html#general-broadcasting-rules)
#  - 뒷 차원에서 부터 비교하여 **①Shape이 같거나**, **②차원 중 값이 1이 존재**하면 broadcasting 가능
#  - 결과 차원은 둘중 큰 size 의 차원으로 **확장** 된다
# 
# 
# 
# ![브로드캐스팅 예](https://www.tutorialspoint.com/numpy/images/array.jpg)
#     - 출처: https://www.tutorialspoint.com/numpy/images/array.jpg

''' 브로드캐스팅 가용한 경우
    A     : 256 x 256 x 3
    B     :             3
    RESULT: 256 X 256 X 3  <-- 결과 차원은 둘중 큰 size의 차원으로 확장

    A     : 8 x 1 x 6 x 1
    B     :     7 x 1 x 5
    RESULT: 8 X 7 X 6 X 5
'''

''' 브로드캐스팅 불가능한 경우
    A     : 3
    B     : 4

    A     :     2 x 1
    B     : 8 x 4 x 3
'''
None

c = np.arange(1000, 1004)
c
# >>> 출력:
# array([1000, 1001, 1002, 1003])

print(a.shape)
print(c.shape)
# >>> 출력:
# (4, 3)
# (4,)

# a + c
# ValueError: operands could not be broadcast together with shapes (4,3) (4,)
# >>> 출력:
# ValueError: operands could not be broadcast together with shapes (4,3) (4,) 

a = np.full(4, 100)
a  # (4, )
# >>> 출력:
# array([100, 100, 100, 100])

a + 1
# >>> 출력:
# array([101, 101, 101, 101])

a + [1]   # (4,) + (1,)
# >>> 출력:
# array([101, 101, 101, 101])

# a + [1, 2]  # (4,) + (2,)
# >>> 출력:
# ValueError: operands could not be broadcast together with shapes (4,) (2,) 

b = np.arange(1, 9).reshape(2, 4)
b
# >>> 출력:
# array([[1, 2, 3, 4],
#        [5, 6, 7, 8]])

# a:    (4,)
# b:  (2, 4)
#  => (2, 4)

a + b
# >>> 출력:
# array([[101, 102, 103, 104],
#        [105, 106, 107, 108]])

b = np.array([[1], [2]])
b  # (2, 1)
# >>> 출력:
# array([[1],
#        [2]])

a + b
# >>> 출력:
# array([[101, 101, 101, 101],
#        [102, 102, 102, 102]])

# ## 도전

arr21 = np.arange(10, 70, 10).reshape(2, 3)
arr21  # (2, 3)
# >>> 출력:
# array([[10, 20, 30],
#        [40, 50, 60]])

arr23 = np.array([1, 2])
arr23  # (2,)
# >>> 출력:
# array([1, 2])

# arr21 + arr23 에러~
# >>> 출력:
# ValueError: operands could not be broadcast together with shapes (2,3) (2,) 

# 도전!  위 두개의 array 를 더하여
# 과연 아래의 결과를 만들수 있을까?
""" 원하는 결과
array([[11, 22, 31],
       [42, 51, 62]])
"""
None

# (arr21.T + arr23).T
# >>> 출력:
# array([[11, 21, 31],
#        [42, 52, 62]])

# arr21 + arr23.reshape(2,1)
# >>> 출력:
# array([[11, 21, 31],
#        [42, 52, 62]])

(arr21.reshape(3,2) + arr23).reshape(2,3)
# >>> 출력:
# array([[11, 22, 31],
#        [42, 51, 62]])

# # Boolean Indexing

# 'Boolean indexing ' !
# array 인덱싱 시, bool 리스트(aka. mask)를 전달하여 True인 경우만 필터링

# for 사용하지 않고도 array 에서 '조건'에 맞는 데이터만 추출 하는 기능

x = np.random.randint(1, 100, size=10)
x
# >>> 출력:
# array([28, 38, 58, 84, 39,  9, 33, 35, 11, 24])

x % 2
# >>> 출력:
# array([0, 0, 0, 0, 1, 1, 1, 1, 1, 0])

even_mask = x % 2 == 0
even_mask
# >>> 출력:
# array([ True,  True,  True,  True, False, False, False, False, False,
#         True])

# 위와 같이 bool 값으로 이루어진 array 를 Mask 라고도 한다
# 위 결과, mask 를 변수에 담아 보겠습니다

# boolean mask 로 인덱싱!
x[even_mask]
# >>> 출력:
# array([28, 38, 58, 84, 24])

# list 나 tuple 같은 iterable 도 bool mask 로 사용 가능.

x[[ True,  True,  True,  True, False, False, False, False, False, True]]
# >>> 출력:
# array([28, 38, 58, 84, 24])

x[x % 2 == 0]
# >>> 출력:
# array([28, 38, 58, 84, 24])

x[x > 30]
# >>> 출력:
# array([38, 58, 84, 39, 33, 35])

# ## 다중조건 사용하기
#  - 파이썬 논리 연산자인 and, or, not 키워드는 사용 불가
#  - & ← AND
#  - | ← OR

# 짝수이면서 30보다 작은 숫자들

# x[(x % 2 == 0) and (x < 30)]

x[(x % 2 == 0) & (x < 30)]
# >>> 출력:
# array([28, 24])

# ## astype() 으로 변환

True, int(True), False, int(False)
# >>> 출력:
# (True, 1, False, 0)

x > 50
# >>> 출력:
# array([False, False,  True,  True, False, False, False, False, False,
#        False])

(x > 50).astype(int)
# >>> 출력:
# array([0, 0, 1, 1, 0, 0, 0, 0, 0, 0])

(x > 50).astype(int).sum()
# >>> 출력:
# 2

np.sum(x > 50)
# >>> 출력:
# 2

True + True
# >>> 출력:
# 2

# ## 도전: 서울시 5월 일자별 평균기온

temp = np.array(
        [23.9, 24.4, 24.1, 25.4, 27.6, 29.7,
         26.7, 25.1, 25.0, 22.7, 21.9, 23.6,
         24.9, 25.9, 23.8, 24.7, 25.6, 26.9,
         28.6, 28.0, 25.1, 26.7, 28.1, 26.5,
         26.3, 25.9, 28.4, 26.1, 27.5, 28.1, 25.8])

"""
평균기온이 25도를 넘는 날수는 총 21일
평균기온이 25를 넘는 날의 평균 기온은 약 26.8도
"""
None

days = np.sum(temp>25)
print(days)
avr = np.average(temp[temp>25])
print(avr)
# >>> 출력:
# 21
# 26.857142857142858

print(np.sum(temp > 25))


temp_avg = np.sum(temp[temp>25])/np.sum(temp > 25)
print(temp_avg)
# >>> 출력:
# 21
# 26.857142857142858

item = (temp > 25).astype(int).sum()
hap = temp[(temp > 25)].sum()
avg = hap / item
print(f"%.2f" % avg)
# >>> 출력:
# 26.86

len(temp[temp > 25]), sum(temp[temp > 25])/len(temp[temp > 25])
# >>> 출력:
# (21, 26.857142857142858)

temp[temp>25].sum()/np.sum(temp>25)
# >>> 출력:
# 26.857142857142858

day = (temp > 25).astype(int).sum()
print(day)
(temp[temp > 25].sum()) / day
# >>> 출력:
# 21
# 26.857142857142858

a = (temp>25.0).sum()
print("평균기온이 25도를 넘는 날수는 총",a,"일")
b = np.average(temp[a])
print("평균기온이 25를 넘는 날의 평균 기온은 약",b,"도")
# >>> 출력:
# 평균기온이 25도를 넘는 날수는 총 21 일
# 평균기온이 25를 넘는 날의 평균 기온은 약 26.7 도

# ↑ for, while, if 등의 명시적인 제어문 사용하지 않고도
# numpy 만으로도 위 동작들 구현 가능.
